Revit 2027 API
BuiltInFailures.RoomFailures.RoomTooShort Property
 [Room] is very short. If this is not intended, change its Upper Limit and Offset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomTooShort { get; }
Public Shared ReadOnly Property RoomTooShort As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomTooShort {
	FailureDefinitionId^ get ();
}
static member RoomTooShort : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace